---
kind: type
id: T:Autodesk.Revit.DB.FilterStringEquals
source: html/9a0d3b08-44ea-963f-f54d-c99e28fd1715.htm
---
# Autodesk.Revit.DB.FilterStringEquals

Tests whether string values from the document match a certain string.

## Syntax (C#)
```csharp
public class FilterStringEquals : FilterStringRuleEvaluator
```

## Remarks
All string comparisons in this class are performed in the case-insensitive manner.